#
# How to use:
# Run 'brew bundle' in the same folder as this file.
#

# Binaries

brew 'ansible'                      # Automate deployment, configuration, and upgrading
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'mkcert'                       # Simple tool to make locally trusted development certificates
brew 'terraform'                    # Tool to build, change, and version infrastructure
brew 'git'
brew 'htop'
brew 'wget'
brew 'mtr'
brew 'nmap'
brew 'geoip'
brew 'watch'
brew 'jq'
brew 'tmux'
brew 'tree'
brew 'kubernetes-cli'
brew 'azure-cli'
brew 'consul'
brew 'vault'
brew 'envoy'
brew 'pwgen'
brew 'colordiff'
brew 'rsync'
brew 'openconnect' 
brew 'iproute2mac'

# Development

#brew 'php'                          # PHP 7.4
#brew 'composer'                     # Composer
#brew 'ruby'                         # Ruby

# Apps

cask 'docker'                       # Docker for Mac
cask 'firefox'                      # Firefox browser
cask 'google-chrome'                # Google Chrome Browser
cask 'iterm2'                       # Terminal
cask 'microsoft-teams'              # Microsoft Teams
cask 'rectangle'                    # Move and resize windows in macOS using keyboard shortcuts or snap areas
cask 'screen'                       # Screen.so
cask 'slack'                        # Slack chats
cask 'wireshark'
cask 'suspicious-package'
cask 'alfred'
cask 'appcleaner'
cask 'cheatsheet'
cask 'google-backup-and-sync'
cask '1password'
cask 'omnigraffle'
cask 'spotify'
cask 'visual-studio-code'
cask 'daisydisk'
cask 'drawio'
cask 'monolingual'
cask 'openconnect-gui'
cask 'fliqlo'

# Mac App Store

